load-test-roadmap-sample.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 15
      arrivalRate: 50
      name: "Warm up"
    - duration: 20
      arrivalRate: 150
      name: "Steady load"
    - duration: 20
      arrivalRate: 300
      name: "Heavy sample"
  processor: "./load-test-processor.js"
  payload:
    path: "./load-test-tokens.csv"
    fields:
      - "token"

scenarios:
  - name: "Turn endpoint"
    weight: 50
    flow:
      - post:
          url: "/api/kingdom/turn"
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer {{ token }}"
            x-csrf-token: "{{ csrfToken }}"
            Cookie: "csrf_token={{ csrfToken }}"
          json:
            action: "next_turn"
          capture:
            - json: "$.ok"
              as: "turnSuccess"
          expect:
            - statusCode: 200

  - name: "Expedition endpoint"
    weight: 50
    flow:
      - get:
          url: "/api/kingdom/expedition/list"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200