load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 100
      name: "Warm up"
    - duration: 120
      arrivalRate: 1000
      name: "Ramp up to 1k concurrent"
    - duration: 180
      arrivalRate: 5000
      name: "Peak load 5k concurrent"
    - duration: 30
      arrivalRate: 100
      name: "Ramp down"
  processor: "./load-test-processor.js"
  payload:
    path: "./load-test-tokens.csv"
    fields:
      - "token"
  variables:
    kingdomIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

scenarios:
  - name: "Turn endpoint"
    weight: 40
    flow:
      - post:
          url: "/api/turn"
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer {{ token }}"
          json:
            action: "next_turn"
          capture:
            - json: "$.ok"
              as: "turnSuccess"
          expect:
            - statusCode: [200, 400]

  - name: "Expedition endpoint"
    weight: 35
    flow:
      - get:
          url: "/api/expedition?limit=20"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Rankings endpoint"
    weight: 25
    flow:
      - get:
          url: "/api/rankings?limit=100&page=1"
          expect:
            - statusCode: 200